{ "name": "Pushpender Sharma", "contact": { "phone": "+91 9672249796", "location": "Delhi, India", "gmail": "your.email@gmail.com", "linkedin": "https://linkedin.com/in/pushpender-sharma", "github": "https://github.com/ipushpie", "portfolio": "https://ipushpie.github.io" }, "objective": "Software Engineer with 2.5+ years of experience in full-stack development along with deployments and AI-driven solutions, seeking roles where I can leverage technical expertise to build scalable, high-impact products.", "education": [ { "degree": "Bachelor of Computer Science", "institution": "Bennett University", "year": "2020 - 2024", "details": "9.0 CGPA with an academic scholarship." }, { "degree": "12th Grade", "institution": "Raath International School", "year": "2019", "details": "Scored 94% and won many quizzes and certificates." } ], "skills": { "languages": ["JavaScript", "TypeScript", "Python", "C++", "Go", "HTML/CSS"], "frameworks": ["React.js", "Next.js", "Angular", "Node.js", "Express.js", "NestJS", "FastAPI"], "libraries": ["Redux", "Zustand", "Axios", "Tanstack", "Tailwind", "Bootstrap", "Chart.js", "Recharts", "MUI", "Shadcn"], "databases": ["MongoDB", "MySQL", "PostgreSQL (with PGVector)", "SQLite"], "tools": ["Git", "Docker", "REST APIs", "NPM", "PNPM", "UV", "PIP", "Nginx", "Caddy"], "cloud": ["Firebase", "Vercel", "Netlify", "Hostinger", "Heroku", "Render", "Railway"], "concepts": ["Data Structures and Algorithms (DSA)", "System Design", "Data Analytics", "RAG"], "softSkills": ["Teamwork", "Problem-solving", "Leadership", "Communication", "Time Management"] }, "experience": [ { "title": "Senior Software Engineer", "company": "GoTrust / AppVin (Sister Company)", "location": "Noida, UP", "duration": "Nov 2024 - Present", "highlights": [ "Contributed to the development of GoTrust, a privacy-autonomous tool built to comply with India’s Digital Personal Data Protection Act (DPDPA) and other privacy laws.", "Implemented core architectural components, including interceptors, routing, theming, and state management, while integrating AI-driven guidance and interactive assistants to simplify the user learning curve and enhance overall tool usability.", "Dockerized the system, cutting customer deployment/setup time by 80% and reducing configuration errors by 40%, significantly enhancing portability and adoption.", "Developed MAIT for MultiStrat, an AI-agentic application that automated contract analysis using retrieval-augmented techniques on vector databases and Gemini APIs, reducing manual review effort by 60% and delivering significantly faster, data-backed insights for clients.", "Led the development of an AI-powered due diligence platform for SidebarLaw, enabling autonomous review of contracts, agreements, and financial documents — projected to cut analysis costs by 50% while improving accuracy and compliance.", "Built AI-driven in-house products, including retrieval-based virtual assistants and workflow automation tools, boosting internal operational efficiency by 30% and reducing repetitive manual tasks for cross-functional teams." ] }, { "title": "Software Engineer", "company": "RemoteState", "location": "Noida, UP", "duration": "Jan 2023 - Nov 2024", "highlights": [ "Served as the tech lead for the project Precium, where I played a key role in developing impactful new features using React.js. These enhancements significantly boosted user engagement and led to a 30% increase in new clients, strengthening the platform’s market presence.", "Spearheaded efforts to enhance the Circonomy website built with Next.js, resulting in a substantial increase of 60% in visitor traffic and engagement.", "Played a pivotal role in delivering the app ux.com.au on time, ensuring adherence to project deadlines.", "Contributed to the development and success of the application Education Planner, incorporating user feedback to optimize usability and functionality.", "Developed a comprehensive backend-driven application using React.js for Nvest, where the architecture is designed to ensure that all functionalities are controlled from the backend, enhancing security and efficiency." ] }, { "title": "Web Development Intern", "company": "Bennett University", "location": "Greater Noida, UP", "duration": "June 2022 - Dec 2022", "highlights": [ "Implemented substantial enhancements to the university website to boost visitor engagement and traffic.", "Developed a dedicated website for the university’s cultural festival, showcasing events and activities." ] } ], "projects": [ { "name": "SocioPedia", "description": "Developed a social media platform using the MERN stack (MongoDB, Express.js, React.js, Node.js) with features such as posts, comments, and authentication. Onboarded a class of 30+ students during testing, gathering feedback that guided iterative improvements through Agile practices.", "github": "https://github.com/ipushpie/sociopedia" }, { "name": "Eat4Fun", "description": "Developed a food delivery application using JavaScript and TypeScript with React.js (frontend), Express.js (backend), and MySQL (database). Designed a responsive interface with Bootstrap and integrated the app with the college canteen, successfully attracting 140+ hostel students as active users.", "github": "https://github.com/ipushpie/eat4fun" }, { "name": "Wikipedia Search Engine", "description": "Built a search engine for Wikipedia using Python and PySpark with Natural Language Processing (NLP) techniques. Processed 200+ Wikipedia articles and delivered query results within 2–3 seconds on a college lab setup. Completed during a 24-hour Datacouch Big Data Analytics hackathon, showcasing the ability to design and implement an end-to-end search pipeline with Hadoop tools under time constraints.", "github": "https://github.com/ipushpie/wikipedia-search-engine" } ], "achievements": [ "Secured a Design Patent and TM ownership for a women’s safety gadget (Ring), developed during a semester project, encompassing its design and idea.", "Successfully advanced through the first round of the SIH National Hackathon, showcasing expertise and clearing the college round amidst stiff competition.", "Acted as the Captain of the Blue house at school, orchestrating various house events and activities throughout the academic year." ] }